In [1]:
import pandas as pd
import numpy as np

In [7]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [9]:
obj.describe() # freq는 최빈값(가장 잦은 데이터 횟수)을 의미함

count     16
unique     3
top        a
freq       8
dtype: object

In [23]:
'''
피클 파일은 텍스트로 저장하는 것이 아닌 객체를 저장할 때 사용하는 방법임
텍스트 수집 -> 정제 -> 분석 -> 시각화 -> 모델링 -> 유지보수
ex)) 10GB -> 파싱 -> 분석 대상 텍스트만 추출 -> dict/list 등에 저장
dict(list,df,ser,...)에 저장된 정제된 텍스트를 바이너리 형식으로 파일에 저장
바이너리 형식이므로 속도가 매우 빠르고 용량이 작음
'''
import pickle

myList = ['a','b']
with open('pic_ex1.pkl', 'wb') as f:
    pickle.dump(myList, f)

In [24]:
f = open('pic_ex1.pkl', 'rb')
pickle.load(f)

['a', 'b']

In [30]:
price = pd.read_pickle('data/examples/yahoo_price.pkl')
price
volume = pd.read_pickle('data/examples/yahoo_volume.pkl')
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [31]:
volume.to_pickle('pic_ex2.pkl')

In [32]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [34]:
returns = price.pct_change() # 이전 데이터(이전 행)와 어느정도의 변동율이 있는지 백분율로 보여줌. 그래서 맨 처음 행은 NaN으로 출력됨
# 계산식 = (현재행-이전행)/현재행
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [40]:
returns.AAPL.corr(returns.GOOG) # 상관관계 correlation

0.40791857616796956

In [41]:
returns.AAPL.corr(returns.IBM)

0.38681743611390995

In [42]:
returns.AAPL.corr(returns.MSFT)

0.38969458628057846

In [44]:
returns.corr() # 전체데이터 상관관계 분석

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [45]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [46]:
returns.corrwith(volume) # returns와 volume 간의 열들의 상관계수를 구함

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [47]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [51]:
obj.value_counts() # 유니크 데이터별로 빈도가 어떻게 되는지 출력. 참고롤 많이 쓰임

c    3
a    3
b    2
d    1
dtype: int64

In [52]:
obj.to_numpy() # 시리즈 -> 넘파이 배열

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [60]:
# pd.value_counts(obj.to_numpy()) 권장하지 않는 방법임
pd.Series(obj.to_numpy()).value_counts(sort=True) # 정렬
pd.Series(obj.to_numpy()).value_counts(ascending=True) # 오름차순

d    1
b    2
c    3
a    3
dtype: int64

In [66]:
8 in obj # 인덱스를 확인하는 것임
'c' in obj # 데이터를 탐색하진 않음

False

In [71]:
obj[obj.isin(['c', 'a'])] # 데이터가 안에 들었는지 확인

0    c
1    a
3    a
4    a
7    c
8    c
dtype: object

In [72]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [73]:
unique_vals = pd.Series(["c", "b", "a"])
unique_vals

0    c
1    b
2    a
dtype: object

In [74]:
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [76]:
pd.Index(unique_vals).get_indexer(to_match) # to_match 데이터에 unique_vals 인덱스가 어떻게 배치됐는지 출력

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [ ]:
'''
용어 정리
데이터프레임과 행렬은 다른 것임
공통점: 2차원
차이점: 행렬(모든 자료의 타입이 무조건 동일), 데이터프레임(모든 자료의 타입이 동일/비동일. 단 열 단위로는 같은 타입)
'''

In [77]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [79]:
data['Qu1'].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [95]:
# 각 열의 데이터 빈도수를 출력
# data.value_counts() # 이건 행의 빈도수를 출력한 것임;
# def vc(x): # 기존의 함수가 없을 때 사용하는 방법임
#     return x.value_counts()
# data.apply(vc)
data.apply(pd.value_counts) # 한줄 코드임. 이와같이 작성하면 완성할 수 있음
# 위의 문법은 이미 있는 함수이므로 가져와서 사용할 수 있는 것임
data.apply(pd.value_counts).fillna(0) # 이렇게 해서 NaN값을 전부 0으로 채울 수 있음

# 다만 권장하지 않는 코드이므로 이를 주의 문구를 출력하는데 주의 문구를 삭제하는 방법은 아래와 같음
# import warnings 
# warnings.filterwarnings(action='ignore')

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [96]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [97]:
data.value_counts() # 행의 형태가 같은 것을 찾아서 개수를 표시해줌

a  b
1  0    2
2  0    2
1  1    1
dtype: int64

In [101]:
pwd

'c:\\Users\\fkfma\\Desktop\\국비교육-AI웹서비스\\TIL\\ds'

In [105]:
df = pd.read_csv('data/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [115]:
df = pd.read_csv('data/examples/ex2.csv')
df # 데이터가 제목으로 읽어짐

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [ ]:
df = pd.read_csv('data/examples/ex2.csv', header=None)
df # header를 None으로 세팅해주면 columns는 자동으로 숫자로 설정되며 데이터는 잘 읽어옴

In [121]:
df = pd.read_csv('data/examples/ex2.csv', header=None, names=['a','b','c','d','msg'])
# df.columns = ['a','d','e','f', 'g'] # 이런식으로 변경할 수는 있음
df

   a   b   c   d    msg
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [123]:
df = pd.read_csv('data/examples/ex2.csv', header=None, names=['a','b','c','d','msg'], index_col='msg')
# index_col: 특정 열의 값을 행 인덱스 라벨로 설정
df

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [130]:
df = pd.read_csv('data/examples/csv_mindex.csv', index_col=['key1','key2'])
# 멀티 인덱스 기능을 이용하는 것임. 이렇게 하면 인덱스를 2개로 지정해놓을 수 있음
# 주로 용도는 대분류, 중분류, 소분류,... 이런식으로 트리구조의 형식으로 데이터를 지정할 수 있음
df.value1

key1  key2
one   a        1
      b        3
      c        5
      d        7
two   a        9
      b       11
      c       13
      d       15
Name: value1, dtype: int64

In [155]:
pd.read_csv('data/examples/ex3.txt') # 출력이 이상함

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [161]:
df = pd.read_csv('data/examples/ex3.txt', sep='\s+') # 정규표현식을 이용하면 분리가 가능해짐
# \s는 공백 한칸을 의미함. 즉 띄어쓰기 한번
df
# df = pd.read_csv('data/examples/segismundo.txt', sep=' ')
# df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [166]:
df = pd.read_csv('data/examples/ex4.csv', skiprows=[0,2,3]) # skiprows를 필요없는 행을 삭제할 수 있음
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [179]:
pd.read_csv('data/examples/ex5.csv')
# 데이터 결측값을 NaN으로 표시해줌

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [182]:
pd.read_csv('data/examples/ex5.csv', na_values=[1,2,5,6])
# na_values에 들어간 값들을 전부 NaN으로 변경
# 뒤에 .fillna(1)을 붙이면 또 NaN은 전부 1로 변경됨...

  something    a     b     c   d message
0       one  NaN   NaN   3.0   4     NaN
1       two  NaN   NaN   NaN   8   world
2     three  9.0  10.0  11.0  12     foo

In [187]:
pd.read_csv('data/examples/ex5.csv', na_filter=True)
# na_filter를 False로 하면 숫자 데이터는 빈 공간이 되며 문자 데이터는 NA로 변경됨
# 기본값은 True

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [188]:
df=pd.read_csv("data/examples/ex5.csv", na_values=['one', 'foo'])
df

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [192]:
df=pd.read_csv("data/examples/ex6.csv")
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     10000 non-null  float64
 1   two     10000 non-null  float64
 2   three   10000 non-null  float64
 3   four    10000 non-null  float64
 4   key     10000 non-null  object
dtypes: float64(4), object(1)
memory usage: 390.8+ KB

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [193]:
# 부족한 메모리, 빅 데이터 읽기 방법
# 1) 큰 메모리를 구매
# 2) 분산 환경 구성
# 3) 빅데이터를 쪼개서 읽기(우리가 하는 방법)

In [218]:
# 청크 단위로 쪼개서 출력
# chksize = 1000
# for cnt, chunk in enumerate(pd.read_csv('data/examples/ex6.csv',chunksize=chksize)):
#     if cnt == 1:
#         print(cnt, chunk)

chker = pd.read_csv('data/examples/ex6.csv',chunksize=1000)
print(type(chker)) # 텍스트파일로 인식함
print(chker) # 메모리 주소만 출력함

for piece in chker:
    tot.add(piece['key'].value_counts(), fill_value=0)
    print(piece['key'].value_counts())
    print('='*50)

<class 'pandas.io.parsers.readers.TextFileReader'>
<pandas.io.parsers.readers.TextFileReader object at 0x0000020EC9CB0100>
S    48
O    44
F    40
H    39
Q    39
J    39
G    38
R    38
X    37
I    37
V    35
U    33
D    32
E    32
W    31
L    31
K    31
A    30
M    29
Y    28
T    27
N    27
C    27
Z    26
B    25
P    25
7    17
6    17
4    17
3    15
8    13
1    13
2    11
9    11
0     9
5     9
Name: key, dtype: int64
==================================================
O    48
L    44
X    40
I    39
R    38
F    37
Q    35
D    34
V    33
K    33
E    32
H    31
J    31
T    31
A    31
U    30
N    30
Z    30
M    28
S    27
Y    27
G    26
P    26
W    25
B    24
C    23
5    20
0    19
9    19
8    19
4    18
1    16
3    16
2    14
6    14
7    12
Name: key, dtype: int64
==================================================
A    40
O    40
X    39
E    39
M    38
H    37
T    36
G    36
K    34
L    34
U    33
F    32
B    32
N    31
V    31
S    30
P    30
Z    29
W    29
J    29
D    28
R    28
Q    28
Y    27
C    27
I    25
6    20
0    19
9    19
7    18
3    15
2    14
4    14
8    14
5    14
1    11
Name: key, dtype: int64
==================================================
X    43
J    41
V    38
Q    38
D    38
C    37
E    37
N    36
P    35
B    35
F    35
L    33
S    32
K    32
R    31
A    31
M    30
H    30
O    29
Y    28
W    28
I    28
G    27
U    26
Z    24
T    23
5    21
6    18
3    17
1    16
2    16
0    15
9    15
8    13
4    12
7    12
Name: key, dtype: int64
==================================================
E    54
Q    42
L    40
H    39
P    38
K    38
M    36
X    35
Y    35
D    34
W    33
U    33
N    33
I    31
T    31
Z    31
F    31
A    31
G    30
B    27
V    26
O    26
C    26
J    25
S    24
2    20
4    18
R    18
0    18
3    18
5    17
6    17
8    16
7    13
9     8
1     8
Name: key, dtype: int64
==================================================
Y    42
F    41
K    41
X    38
V    37
L    35
W    35
E    35
J    34
M    33
R    33
P    32
N    32
U    32
I    32
D    31
S    31
B    30
G    28
H    28
Q    27
O    26
A    25
1    25
C    25
T    24
Z    23
5    22
9    20
7    20
6    17
8    17
3    16
4    13
2    12
0     8
Name: key, dtype: int64
==================================================
L    41
C    41
Z    39
W    39
X    38
O    37
I    36
T    36
R    35
H    34
J    33
N    32
G    31
D    31
F    31
P    30
E    30
B    30
V    30
U    29
M    29
Q    28
8    25
Y    24
A    23
K    22
7    22
S    21
9    20
0    18
4    18
2    17
1    16
5    15
3    11
6     8
Name: key, dtype: int64
==================================================
J    42
M    40
X    39
E    39
D    39
A    38
V    38
G    37
P    35
Q    35
R    34
L    34
H    34
B    34
Y    33
I    33
O    32
U    30
N    29
T    28
K    27
F    26
S    26
C    26
W    25
Z    22
6    21
4    19
8    18
2    16
7    14
0    14
3    13
5    13
1    12
9     5
Name: key, dtype: int64
==================================================
O    42
U    41
S    40
A    39
V    37
E    35
T    35
P    35
J    34
K    34
M    34
Q    34
I    33
Z    33
Y    32
W    32
B    32
R    29
F    29
D    28
N    27
X    27
C    26
H    25
L    24
G    24
7    22
4    21
9    18
1    17
2    17
3    15
0    14
6    12
8    12
5    11
Name: key, dtype: int64
==================================================
K    42
M    41
U    39
Y    38
P    38
E    35
R    34
Q    34
I    33
T    33
H    33
F    33
B    33
A    32
Z    31
G    31
L    30
N    29
S    29
J    29
C    28
W    28
X    28
3    26
D    25
V    23
6    22
4    21
O    19
0    17
2    15
9    15
8    15
5    15
7    14
1    12
Name: key, dtype: int64
==================================================

In [208]:
tot = pd.Series([], dtype='int64') # 빈 시리즈 정의, 정수가 저장될 수 있음
tot

Series([], dtype: int64)

In [211]:
ser1 = pd.Series([10,20,])
ser1

0    10
1    20
dtype: int64

In [236]:
tot.add(ser1, fill_value=0)

0    10.0
1    20.0
dtype: float64

In [241]:
# ex6.csv의 key 열에 대해 문자별 빈도수 출력
chker = pd.read_csv('data/examples/ex6.csv',chunksize=1000)
tot = pd.Series([], dtype='int64')
for piece in chker:
    tot = tot.add(piece.key.value_counts(), fill_value=0)
print(tot)

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [245]:
df = pd.read_csv('data/examples/ex7.csv')
df.columns
df.index
df.values

array([[1, 2, 3],
       [1, 2, 3]], dtype=int64)

In [248]:
import csv
reader = csv.reader(open('data/examples/ex7.csv'))
for line in reader: # 이런 식으로 잘 쓰이진 않음
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [249]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [260]:
import json  # API 사용할 때 주로 쓰일 듯
res = json.loads(obj) # obj에 저장된 딕셔너리 구조의 문자열을 읽고 json 형식으로 변환
print(type(res)) # json 로딩하면 타입은 dict 구조로 변경됨
print(res['siblings'][0]['name'])
res

<class 'dict'>
Scott

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [261]:
asjson=json.dumps(res) #res에 저장된 딕셔너리 구조의 데이터를 문자열로 저장
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [265]:
pd.DataFrame(res['siblings']) # 이렇게도 데이터프레임을 생성할 수 있음

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [267]:
data = pd.read_json('data/examples/example.json') # jsob -> DataFrame
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [273]:
data.to_csv('data_to_csv.csv', index=False) # 어지간하면 index는 false로 해놔야 새로운 컬럼이 안생김...

In [274]:
data.to_json('data_to_json.json')

In [2]:
import pandas as pd
import numpy as np

In [5]:
# ImportError: html5lib not found, please install it
# !pip install html5lib

tables = pd.read_html("data/examples/fdic_failed_bank_list.html")
len(tables)

1

In [7]:
tables[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [15]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0)
# pd.read_excel('data/examples/ex1.xlsx').drop('Unnamed: 0', axis=1) 이렇게도 가능함

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0, sheet_name='Sheet1') # Sheet1를 읽어옴

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
df = pd.read_excel("data/examples/ex1.xlsx", index_col=0, sheet_name='Sheet2') # Sheet2를 읽어옴
df

   q   w   e   r message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
df.to_excel("ex1_copy.xlsx",sheet_name="Mysheet1")

In [24]:
# 연습문제

In [37]:
# *titanic 데이터셋에 대해 다음 작업을 수행하시오.
import pandas as pd
import numpy as np

df = pd.read_csv('data/datasets/titanic/train.csv')
# 1. 승선항구가 'C'인 자료만 추출하시오.
df[df.Embarked == 'C']
# 2. SibSp + Parch 의 합이 0인 자료만 추출하시오.
df[df['SibSp'] + df['Parch'] == 0]
# 3. Pclass가 1인 자료만 추출하시오.
df[df.Pclass == 1]
# 4. Fare 열 값이 20이상 50미만인 자료만 추출하시오.
df[(df.Fare >= 20) & (df.Fare < 50)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [71]:
# * yahoo finance 사이트 데이터셋(finance.yahoo.com)
# historical data 에서 가져오면 됨
df = pd.read_csv('samsun2024.csv')
df
# 5. 2024년도 삼성전자 주가데이터를 가져온 다음 아래와 같은 작업을 수행해보세요.
# 1) 각 열 단위로 최대값을 출력하시오.
df.apply(max)

# 2) 각 열 단위로 최소값을 출력하시오.
df.apply(min)

# 3) 각 열 단위로 최대값-최소값을 출력하시오.
def max_min(x):
    try:
        return max(x) - min(x)
    except:
        return 
df.apply(max_min)

# 4) 기술통계를 구하시오.
df.info()
df.describe()

13600.0
1
14000.0
2
13800.0
3
14300.0
4
14300.0
5
54733351
6

Date         None
Open         None
High         None
Low          None
Close        None
Adj Close    None
Volume       None
dtype: object